In [1]:
import pandas as pd

In [2]:
dict = {
    "name" : ["Zubair","Asif","Nasir","Junaid"],
    "marks" : [50,50,50,0],
    "city" : ["Karachi","Lahore","Multan","Islamabd"]
}

df = pd.DataFrame(dict)
df

     name  marks      city
0  Zubair     50   Karachi
1    Asif     50    Lahore
2   Nasir     50    Multan
3  Junaid      0  Islamabd

In [3]:
df.to_csv("Practise 1.csv")

In [4]:
df.to_csv("Practise_1.csv", index=False)

In [5]:
df.head(2)

     name  marks     city
0  Zubair     50  Karachi
1    Asif     50   Lahore

In [6]:
df.tail(2)

     name  marks      city
2   Nasir     50    Multan
3  Junaid      0  Islamabd

In [7]:
df.describe()

       marks
count    4.0
mean    37.5
std     25.0
min      0.0
25%     37.5
50%     50.0
75%     50.0
max     50.0

In [8]:
file = pd.read_csv("Practise_Set_1.csv")

In [9]:
file

   Unnamed: 0    name  marks      city
0           0  Zubair     50   Karachi
1           1    Asif     50    Lahore
2           2   Nasir     50    Multan
3           3  Junaid      0  Islamabd

In [10]:
file["marks"][2] = 23

C:\Users\Faaz Ali\AppData\Local\Temp\ipykernel_6064\1769524419.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file["marks"][2] = 23

In [11]:
file

   Unnamed: 0    name  marks      city
0           0  Zubair     50   Karachi
1           1    Asif     50    Lahore
2           2   Nasir     23    Multan
3           3  Junaid      0  Islamabd

In [12]:
file.index = ['1st', '2nd', '3rd', '4th']

In [13]:
file

     Unnamed: 0    name  marks      city
1st           0  Zubair     50   Karachi
2nd           1    Asif     50    Lahore
3rd           2   Nasir     23    Multan
4th           3  Junaid      0  Islamabd

In [14]:
import numpy as np

In [15]:
ser = pd.Series(np.random.rand(10))
ser

0    0.996555
1    0.947174
2    0.425520
3    0.456091
4    0.803190
5    0.728904
6    0.273964
7    0.908465
8    0.360568
9    0.717988
dtype: float64

In [16]:
np.random.rand(3)

array([0.56702661, 0.32007361, 0.97620164])

In [17]:
newdf = pd.DataFrame(np.random.rand(523,3), index=np.arange(523))

In [18]:
newdf

            0         1         2
0    0.046151  0.041055  0.824276
1    0.005390  0.495804  0.081541
2    0.758939  0.341046  0.119749
3    0.206986  0.560605  0.289214
4    0.726443  0.435801  0.950353
..        ...       ...       ...
518  0.228793  0.804591  0.285065
519  0.556308  0.802982  0.507492
520  0.786649  0.633085  0.032635
521  0.012207  0.618491  0.301020
522  0.535186  0.454058  0.664722

[523 rows x 3 columns]

In [21]:
newdf.head(7)

          0         1         2
0  0.046151  0.041055  0.824276
1  0.005390  0.495804  0.081541
2  0.758939  0.341046  0.119749
3  0.206986  0.560605  0.289214
4  0.726443  0.435801  0.950353
5  0.400567  0.283861  0.848194
6  0.697346  0.547972  0.176615

In [23]:
newdf.tail()

            0         1         2
518  0.228793  0.804591  0.285065
519  0.556308  0.802982  0.507492
520  0.786649  0.633085  0.032635
521  0.012207  0.618491  0.301020
522  0.535186  0.454058  0.664722

In [24]:
newdf.describe()

                0           1           2
count  523.000000  523.000000  523.000000
mean     0.483904    0.505794    0.491454
std      0.296822    0.285260    0.286661
min      0.000457    0.000528    0.001093
25%      0.232388    0.285635    0.247948
50%      0.473576    0.510297    0.485895
75%      0.747757    0.736865    0.742727
max      0.994519    0.999678    0.998522

In [28]:
newdf.dtypes

0    float64
1    float64
2    float64
dtype: object

In [29]:
ser.dtypes

dtype('float64')